app/controllers/bread/bread_logs_controller.rb

SELECT * FROM `bread_logs` ORDER BY id LIMIT 0, 25
---
  def index
    @bread_logs = Bread::BreadLog.paginate :page => params[:page], :order => "id", :per_page => 25

SELECT * FROM `bread_logs` WHERE (`bread_logs`.`id` = 1)
---
  def edit
    @bread_log = Bread::BreadLog.find(params[:id])

SELECT * FROM `bread_logs` WHERE (`bread_logs`.`id` = 1)
UPDATE `bread_logs` SET `updated_at` = '2013-04-01 02:28:31', `cat_id` = 10 WHERE `id` = 1
---
  def update
    @bread_log = Bread::BreadLog.find(params[:id])
    d, m, y = params[:log_date].split("/")
    @bread_log.event_date = Date.new(y.to_i, m.to_i, d.to_i)

    if @bread_log.update_attributes(params[:bread_bread_log])