app/controllers/bread/categories_controller.rb

  def create
    @category = Bread::Category.new(params[:bread_category].permit(:name, :description))

    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `description`) VALUES('dfsdfdsf', '2013-04-01 02:24:18', '2013-04-01 02:24:18', '')

  def index
    @categories = Bread::Category.paginate :page => params[:page], :order => "id", :per_page => 25
---
SELECT * FROM `categories` ORDER BY id LIMIT 0, 25