app/controllers/bread/items_controller.rb

SELECT * FROM `items` ORDER BY id LIMIT 0, 25
---
  def index
    @items = Bread::Item.paginate :page => params[:page], :order => "id", :per_page => 25

INSERT INTO `items` (`name`, `price`, `created_at`, `updated_at`, `category_id`) VALUES('sdfsdfsdfsdf', 2.0, '2013-04-01 02:24:30', '2013-04-01 02:24:30', 8)
---
  def create
    @item = Bread::Item.new(params[:bread_item])

    if @item.save