app/controllers/bread/orders_controller.rb

  def create
    order_string = []
    y, m, d = params[:bread_order][:saturday_int].split("-")
    params[:bread_order][:saturday_int] = Date.new(y.to_i, m.to_i, d.to_i)
    params[:items].each_pair do |item_id, x|
      order_string << "#{item_id},#{x}" unless x.blank? || x.to_i == 0
---
INSERT INTO `orders` (`created_at`, `history`, `saturday_int`, `paid`, `updated_at`, `order`, `user_id`) VALUES('2013-04-01 02:24:00', NULL, 15801, 0, '2013-04-01 02:24:00', '17,1;', 2)

  def edit
    @order = Bread::Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 71)

  def index
    if (@user.has_rights_for?([RIGHTS[:admin], RIGHTS[:bread_admin]]) rescue false)
      @orders = Bread::Order.paginate :page => params[:page], :order => "id DESC", :per_page => 10
    else
      @orders = @user.orders.paginate :page => params[:page], :order => "id DESC", :per_page => 10
---
SELECT * FROM `orders` ORDER BY id DESC LIMIT 0, 25
SELECT count(*) AS count_all FROM `orders`
SELECT * FROM `user_rights` WHERE (`user_rights`.user_id = 1)

  def update
    @order = Bread::Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 71)