app/controllers/book/authors_controller.rb

SELECT * FROM `authors` ORDER BY name ASC LIMIT 0, 25
---
  def index
    @authors = Book::Author.paginate :page => params[:page], :order => "name ASC", :per_page => 25

SELECT * FROM `authors` WHERE (`authors`.`id` = 2)
---
  def show
    @author = Book::Author.find(params[:id])

SELECT * FROM `authors` WHERE (`authors`.`id` = 2)
---
  def edit
    @author = Book::Author.find(params[:id])

INSERT INTO `authors` (`name`, `created_at`, `updated_at`) VALUES('Jan Maat', '2013-02-03 15:21:24', '2013-02-03 15:21:24')
---
  def create
    @author = Book::Author.new(params[:book_author])

    if @author.save

SELECT * FROM `authors` WHERE (`authors`.`id` = 2)
---
  def update
    @author = Book::Author.find(params[:id])

SELECT * FROM `authors` WHERE (`authors`.`id` = 1)
DELETE FROM `authors` WHERE `id` = 1
---
  def destroy
    @author = Book::Author.find(params[:id])
    @author.destroy