app/controllers/book/books_controller.rb

SELECT * FROM `books` ORDER BY title ASC LIMIT 0, 25
---
  def index
    @books = Book::Book.paginate :page => params[:page], :order => "title ASC", :per_page => 25

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def show
    @book = Book::Book.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def edit
    @book = Book::Book.find(params[:id])

INSERT INTO `books` (`comment`, `created_at`, `title`, `isbn`, `print_nr`, `genre_id`, `updated_at`, `pages`, `language_id`, `author_id`, `print_year`, `serie_id`, `original_language_id`, `publisher_id`) VALUES('', '2013-04-01 02:43:31', 'Flof boek', '1234567890123', 1, 1, '2013-04-01 02:43:31', '314', 1, 3, 2013, 1, 1, 1)
---
  def create
    @book = Book::Book.new(params[:book_book])

    if @book.save