app/controllers/book/genres_controller.rb

SELECT * FROM `genres` ORDER BY name ASC, name ASC LIMIT 0, 25
---
  def index
    @genres = Book::Genre.all_sorted.paginate :page => params[:page], :order => "name ASC", :per_page => 25

INSERT INTO `genres` (`name`, `created_at`, `updated_at`) VALUES('Bla', '2013-02-03 15:28:24', '2013-02-03 15:28:24')
---
  def create
    @genre = Book::Genre.new(params[:book_genre])

    if @genre.save