app/controllers/book/languages_controller.rb

  def index
    @languages = Book::Language.all_sorted.paginate :page => params[:page], :order => "name ASC", :per_page => 25
---
SELECT * FROM `languages` ORDER BY name ASC, name ASC LIMIT 0, 25

  def create
    @language = Book::Language.new(params[:book_language])

    if @language.save
---
INSERT INTO `languages` (`name`, `created_at`, `updated_at`) VALUES('zefdsfdsf', '2013-02-03 15:28:31', '2013-02-03 15:28:31')