app/controllers/book/publishers_controller.rb

  def create
    @publisher = Book::Publisher.new(params[:book_publisher].permit(:name, :place))

    if @publisher.save
---
INSERT INTO `publishers` (`name`, `created_at`, `updated_at`, `place`) VALUES('Publi1', '2013-02-03 15:28:39', '2013-02-03 15:28:39', '')

  def index
    @publishers = Book::Publisher.paginate :page => params[:page], :order => "name", :per_page => 25
---
SELECT * FROM `publishers` ORDER BY name ASC, name ASC LIMIT 0, 25