app/controllers/book/series_controller.rb

SELECT * FROM `series` ORDER BY name ASC, name ASC LIMIT 0, 25
---
  def index
    @series = Book::Serie.all_sorted_with_author.paginate :page => params[:page], :order => "name ASC", :per_page => 25

SELECT * FROM `series` WHERE (`series`.`id` = 1)
---
  def edit
    @serie = Book::Serie.find(params[:id])

INSERT INTO `series` (`name`, `created_at`, `updated_at`, `author_id`) VALUES('FUCK', '2013-02-03 15:29:19', '2013-02-03 15:29:19', 3)
---
  def create
    @serie = Book::Serie.new(params[:book_serie])

    if @serie.save

SELECT * FROM `series` WHERE (`series`.`id` = 1)
---
  def update
    @serie = Book::Serie.find(params[:id])