app/controllers/bread_logs_controller.rb

SELECT * FROM `bread_logs` ORDER BY id LIMIT 0, 25
---
  def index
    @bread_logs = BreadLog.paginate :page => params[:page], :order => "id", :per_page => 25

INSERT INTO `bread_logs` (`price`, `created_at`, `updated_at`, `cat_id`, `event_date`) VALUES(2.5, '2013-01-27 15:16:22', '2013-01-27 15:16:22', 0, 15732)
---
  def create
    @bread_log = BreadLog.new(params[:bread_log])
    d, m, y = params[:log_date].split("/")
    @bread_log.event_date = Date.new(y.to_i, m.to_i, d.to_i)

    if @bread_log.save

SELECT * FROM `bread_logs` WHERE (`bread_logs`.`id` = 1)
---
  def edit
    @bread_log = BreadLog.find(params[:id])

SELECT * FROM `bread_logs` WHERE (`bread_logs`.`id` = 1)
UPDATE `bread_logs` SET `updated_at` = '2013-01-27 15:18:24', `event_date` = 15366 WHERE `id` = 1
---
  def update
    @bread_log = BreadLog.find(params[:id])
    d, m, y = params[:log_date].split("/")
    @bread_log.event_date = Date.new(y.to_i, m.to_i, d.to_i)

    if @bread_log.update_attributes(params[:bread_log])