app/controllers/categories_controller.rb

SELECT * FROM `categories` ORDER BY id LIMIT 0, 25
---
  def index
    @categories = Category.paginate :page => params[:page], :order => "id", :per_page => 25

INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `description`) VALUES('Witte broden', '2012-06-03 22:20:16', '2012-06-03 22:20:16', 'Zachte witte broden...')
---
  def create
    @category = Category.new(params[:category])

    if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
UPDATE `categories` SET `updated_at` = '2012-06-03 22:21:04', `name` = 'Grijze broden...' WHERE `id` = 2
---
  def update
    @category = Category.find(params[:id])

    if @category.update_attributes(params[:category])

SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
DELETE FROM `categories` WHERE `id` = 2
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy