app/controllers/items_controller.rb

SELECT * FROM `items` ORDER BY id LIMIT 0, 25
---
  def index
    @items = Item.paginate :page => params[:page], :order => "id", :per_page => 25

SELECT * FROM `items` WHERE (`items`.`id` = 2)
---
  def show
    @item = Item.find(params[:id])

INSERT INTO `items` (`name`, `price`, `created_at`, `updated_at`, `category_id`) VALUES('Wit brood, gesneden', 1.2, '2012-06-03 22:32:52', '2012-06-03 22:32:52', 3)
---
  def create
    @item = Item.new(params[:item])

    if @item.save

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def edit
    @item = Item.find(params[:id])

SELECT * FROM `items` WHERE (`items`.`id` = 5)
UPDATE `items` SET `updated_at` = '2012-06-04 10:20:01', `category_id` = 4 WHERE `id` = 5
---
  def update
    @item = Item.find(params[:id])

    if @item.update_attributes(params[:item])

SELECT * FROM `items` WHERE (`items`.`id` = 3)
DELETE FROM `items` WHERE `id` = 3
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy