app/controllers/news_feeds_controller.rb

SELECT * FROM `news_feeds` ORDER BY id LIMIT 0, 25
---
  def index
    @feeds = NewsFeed.paginate :page => params[:page], :order => "id", :per_page => 25

INSERT INTO `news_feeds` (`created_at`, `updated_at`, `text`) VALUES('2012-11-02 19:33:09', '2012-11-02 19:33:09', 'The first feed is a fact!')
---
  def create
    @feed = NewsFeed.new(params[:news_feed].permit(:text))

    if @feed.save