app/controllers/orders_controller.rb

  def index
    if (@user.has_rights_for?([RIGHTS[:admin], RIGHTS[:bread_admin]]) rescue false)
      @orders = Order.paginate :page => params[:page], :order => "id", :per_page => 25
    else
      @orders = @user.orders.paginate :page => params[:page], :order => "id", :per_page => 25
---
SELECT * FROM `orders` ORDER BY id DESC LIMIT 0, 25
SELECT count(*) AS count_all FROM `orders`
SELECT * FROM `user_rights` WHERE (`user_rights`.user_id = 3)

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)

  def create
    @order = Order.new(params[:order])
    order_string = ""
    y, m, d = params[:order][:saturday_int].split("-")
    params[:order][:saturday_int] = Date.new(y.to_i, m.to_i, d.to_i)
    params[:items].each_pair do |item_id, x|
      order_string << "#{item_id},#{x[:quantity]};" unless x[:quantity].blank?
---
INSERT INTO `orders` (`created_at`, `history`, `saturday_int`, `paid`, `updated_at`, `order`, `user_id`) VALUES('2012-08-28 21:20:34', NULL, 15584, 0, '2012-08-28 21:20:34', '6,1;1,4;5,2;', 3)

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)

  def update
    @order = Order.find(params[:id])
    y, m, d = params[:order][:saturday_int].split("-")
    params[:order][:saturday_int] = Date.new(y.to_i, m.to_i, d.to_i)

    if @order.update_attributes(params[:order])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 7)
UPDATE `orders` SET `updated_at` = '2012-08-26 11:57:47', `saturday_int` = 15584 WHERE `id` = 6

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
DELETE FROM `orders` WHERE `id` = 1

  def set_paid
    if Order.update_all("paid = 1", "id = #{params[:id]}")
---
UPDATE `orders` SET paid = 1 WHERE (id = 6)