app/controllers/reports_controller.rb

  def bread_report
    @next_saturday = ((Date.today.end_of_week - 1) > Date.today ? (Date.today.end_of_week - 1) : (Date.today.end_of_week + 6))
    @next_saturday_int = (@next_saturday - Date.new(1970,1,1)).to_i

    orders = Order.find(:all, :conditions => ["saturday_int = ?", @next_saturday_int])


    @breads_shorted = orders.inject({}) do |h, x|
      x[:order].split(";").each do |arr|
        unless arr.blank?
          id, quant = arr.split(",")
          h[id] ||= 0
          h[id] += quant.to_i
        end
      end
      h
    end.inject({}) do |h, x|
      name = Item.find(x[0]).name
      good_name = name.split(",")[0]
      h[good_name] ||= 0
      h[good_name] += x[1]
      h
    end

    @people = orders.inject({}) do |h, x|
      user = User.find(x[:user_id]).to_s
---
SELECT * FROM `orders` WHERE (saturday_int = 15584)
SELECT * FROM `items` WHERE (`items`.`id` = 4)
SELECT * FROM `users` WHERE (`users`.`id` = 3)