app/controllers/statics_controller.rb

  def index
    @statics = Static.paginate :page => params[:page], :order => "id", :per_page => 25
---
SELECT * FROM `statics` ORDER BY id LIMIT 0, 25
SELECT count(*) AS count_all FROM `statics`

  def edit
    @static = Static.find(params[:id])
---
SELECT * FROM `statics` WHERE (`statics`.`id` = 3)

  def update
    @static = Static.find(params[:id])

    if @static.update_attributes(params[:static])
---
SELECT * FROM `statics` WHERE (`statics`.`id` = 3)
UPDATE `statics` SET `updated_at` = '2012-06-03 17:50:25', `text` = 'Edit' WHERE `id` = 3