app/controllers/user_sessions_controller.rb

  def create
    @user = User.find_by_login_and_password(params[:user][:login], params[:user][:password])
    @session = UserSession.new(:user_id => @user.id) unless @user.nil?
    if @user && @session.save
      session[:user] = @session.id
      flash[:success] = "Hello #{@session.user.first_name}, you are logged in."
---
SELECT * FROM `users` WHERE (`users`.`password` = 'nicor' AND `users`.`login` = 'nreynen') LIMIT 1
INSERT INTO `user_sessions` (`created_at`, `updated_at`, `user_id`, `path`, `ip_address`) VALUES('2012-08-25 10:56:22', '2012-08-25 10:56:22', 3, NULL, NULL)
SELECT * FROM `users` WHERE (`users`.`id` = 3)

  def destroy
    UserSession.destroy(@session)
---
DELETE FROM `user_sessions` WHERE `id` = 12