app/controllers/users_controller.rb

  def change_password
    if params[:user]
      if params[:user][:old_pwd] == @usr.password && params[:user][:new_pwd].length > 7 && params[:user][:new_pwd] == params[:user][:rpt_pwd]
        @usr.password = params[:user][:new_pwd]
        @usr.save
---
UPDATE `users` SET `updated_at` = '2012-09-17 16:41:58', `password` = 'ownage1989' WHERE `id` = 3

  def create
    @usr = User.new(params[:user].permit(:first_name, :last_name, :login, :password, :email, :user_rights))
    params[:rights].each do |right|
      params[:user][:user_rights] ||= []
      params[:user][:user_rights] << UserRight.create({:user_id => @usr.id, :rights_key => right})
---
INSERT INTO `users` (`created_at`, `updated_at`, `last_name`, `login`, `password`, `first_name`) VALUES('2012-06-03 21:46:24', '2012-06-03 21:46:24', 'Reynen', 'nreynen', 'nicor', 'Nico')

  def destroy
    @usr = User.find(params[:id])
    @usr.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1

  def edit
    @usr = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)

  def index
    @usrs = User.paginate :page => params[:page], :order => "first_name, last_name", :per_page => 25
---
SELECT * FROM `users` ORDER BY id LIMIT 0, 25

  def show
    @usr = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def update
    @usr = User.find(params[:id])
    params[:rights].each do |right|
      params[:user][:user_rights] ||= []
      params[:user][:user_rights] << UserRight.create({:user_id => @usr.id, :rights_key => right})
    end if params[:rights]

    if @usr.update_attributes(params[:user].permit(:first_name, :last_name, :login, :password, :email, :user_rights))
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
SELECT * FROM `user_rights` WHERE (`user_rights`.user_id = 3)
INSERT INTO `user_rights` (`rights_key`, `created_at`, `updated_at`, `user_id`) VALUES('Admin', '2012-08-26 02:13:52', '2012-08-26 02:13:52', 3)
UPDATE `users` SET `updated_at` = '2012-06-03 21:55:43', `first_name` = 'ENico' WHERE `id` = 3