app/controllers/user_rights_controller.rb

SELECT * FROM `user_rights` ORDER BY rights_key LIMIT 0, 25
---
  def index
    @rights = UserRight.paginate :page => params[:page], :order => "rights_key", :per_page => 25