app/controllers/user_rights_controller.rb

  def index
    @rights_map = UserRight.all.inject({}) do |h, x|
      h[x[:rights_key]] ||= []
      h[x[:rights_key]] << "#{x.user.first_name} #{x.user.last_name}"
---
SELECT * FROM `user_rights` WHERE (`user_rights`.user_id = 3)
SELECT * FROM `users` WHERE (`users`.`id` = 3)